baitour/gsoap/BaitourServiceSoap.GetAllCommonPolicyZIP.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns1="http://www.baitour.com/">
 <SOAP-ENV:Body>
   <ns1:GetAllCommonPolicyZIP>
    <ns1:tripType></ns1:tripType>
    <ns1:ticketType></ns1:ticketType>
    <ns1:agentUserName></ns1:agentUserName>
    <ns1:pwd></ns1:pwd>
    <ns1:zip></ns1:zip>
   </ns1:GetAllCommonPolicyZIP>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
